function SS = LBss4(RR); %計算適應值(選拆利潤(拆解成本最大)碳足跡(拆解碳足跡小)總目標式)
% % %% 拆裝時間
asb=[18];
asb2=[1];
add=0;
ans=[];
Dc=[18	10	16	17	3	14	2	9	5	6	7	15	11	12	13	1	8	4];%liaison零件關係
DC2=[0.9297	0.911	0.797	0.797	0.797	0.797	0.482	0.294	0.266	0.266	0.224	0.1727	0.1727	0.1727	0.1354	0.0234	0.0234	0.0234];%liaison單一零件組拆裝成本
gw=[0.015,0.005,0.003,0.008,0.0025,0.003,0.0013,0.006,0.002,0.003,0.002,0.009,0.0021,0.0012,0.0025,0.003,0.003,0.004];%各零件重量
reuse=[2 5 7 9 13];% 重新使用
recycle=[3  10  14 16 17 18];%回收
Remanufacturing=[4 6 8 11 12];%重新加工

c=7.2844;%拆裝總成本
mc=[25     5     2    25    10     8     7    10     8     2     5    20     5     5     7     2     2     2];%各零件成本
%% 碳足跡
asb2=[1];
Cs=0.509;%% 碳係數/s0.0001413889
gw=[0.015,0.005,0.003,0.008,0.0025,0.003,0.0013,0.006,0.002,0.003,0.002,0.009,0.0021,0.0012,0.0025,0.003,0.003,0.004];%各零件重量

cc=[0.310000000000000	0.310000000000000	0.430000000000000	0.430000000000000	0.120000000000000	0.430000000000000	0.120000000000000	0.310000000000000	0.430000000000000	0.430000000000000	0.310000000000000	0.310000000000000	0.120000000000000	0.310000000000000	0.310000000000000	0.310000000000000	0.310000000000000	0.430000000000000];
 a=[];  
add=0;
    %% 選拆後利潤
    for i =length(asb)
        a=[a,find(RR==asb(i))];
    end
    d1=RR(1:max(a)-1);
    d=RR(max(a):end);
   
   
 %% 拆卸成本
        for j =1:length(Dc)
            a=find(d1==Dc(j));
            if a==1
                add=add+DC2(j);
            end
        end
        
        for j =1:length(d1)
%% 加工成本%% remanufact
n=0;
      for j =1:length(Remanufacturing)
          a=find(d1==Remanufacturing(j));
          if a>1
          n=n+1;
          end
      end
            add=add+1.5.*n;%%加工係數

        end
%% 新零件成本      
        new=sum(mc(d));
       add=add+new;

%% 回收利益
      get=sum(gw(d));%%%%%%%%%%目前只算廢棄零件回收




%% recycle



f1=200-add+get;

 %% 選拆碳足跡  
 for i =length(asb2)
     a=[a,find(RR==asb2(i))];
 end
    d1=RR(1:max(a)-1);
    d=RR(max(a):end);
    %% 拆解之碳足跡
  cf=sum(gw(d1)).*Cs;%%%%%%%%%目前只算拆解零件之碳足跡
  %% 購入零件之碳足跡
 cp=0;
%% 再加工之碳足跡
cm=0;
for j =1:length(Remanufacturing)
    a=find(d1==Remanufacturing(j));
    if a>=1
        cm=cm+gw(d1(a)).*cc(d1(a));
    end
end
%% 再回收之碳足跡
cy=0;


f2=cf+cp+cm+cy;
   
w1=rand;
w2=1-w1;
SS=[(w2.*f2)./(w1.* f1)];
% SS=f2./f1;





