% function SS = LBss1(i,GCT,Information,fxm_ans) %計算適應值
% 
% 
% add = 0;
% OR = [];
% tn = 0 ;%最小工作站數
% Ti = []; %各工作站工作時間
% for j = 1:nnz(fxm_ans{i})
%     if add+Information(fxm_ans{i}(j)) <= GCT
%        add =add+Information(fxm_ans{i}(j));
%     else
%         tn=tn+1;
%         Ti(tn) = add;
%         add = Information(fxm_ans{i}(j));
%     end
% end
%  tn=tn+1;
% %  SS= tn;%求最小工作站
%  
%  Ti(tn) = add;
%  SS = (((sum((GCT-Ti).^2))/tn)^(1/2));%minSI
%  
% % Ti(tn) = CT;
% % SS =(((sum((GCT-Ti).^2))/tn)^(1/2))*L1-(sum(Ti)/(tn*GCT))*L2;%學姊論文目標式minSI和最小工作站
function [SS1,SS,SS2] = LBss1(RR,T1,T22); %計算適應值(組裝工具和方向性)
Cs=0.0001413889;%% 組裝時間乘碳係數
% T1=[3	1	2	3	4	3	3	3	3	3	1	1	1	2	4	2	2	3];
% T22=[0	2	2	0	2	1	1	0	1	2	0	2	2	2	2	2	2	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 0	2	2	0	2	1	1	0	1	2	0	2	2	2	2	2	2	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 1	1	1	1	1	0	2	1	2	1	1	1	1	1	1	1	1	1
% 1	1	1	1	1	2	0	1	0	1	1	1	1	1	1	1	1	1
% 0	2	2	0	2	1	1	0	1	2	0	2	2	2	2	2	2	1
% 1	1	1	1	1	2	0	1	0	1	1	1	1	1	1	1	1	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 0	2	2	0	2	1	1	0	1	2	0	2	2	2	2	2	2	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 2	0	0	2	0	1	1	2	1	0	2	0	0	0	0	0	0	1
% 1	1	1	1	1	1	1	1	1	1	1	1	1	1	1	1	1	0];
% RR=[12	9	6	15	13	2	11	1	7	10	17	5	3	8	4	18	14	16];
% RR=[14 13 11 10 9 18 17 16 15 12 4 8 7 6 5 2 3 1 ];
%% 組拆裝時間
SS=0;
for i = 1:length(RR)-1
 SS=SS+T22(RR(i),RR(i+1));%方向
 if T1(RR(i))~=T1(RR(i+1));%工具
     SS=SS+1;
 end
end
SS2=SS;
SS1=(1+SS./10).*SS;
SS=SS1.*Cs;
