clc;
clear;
tic;
%% 參數設定
antp=100;%螞蟻數量
CAPITAL=14;%城市數量
PP=500;%迭代數
F1=0.6;%狀態轉換機率
HOTF=0.01;%費洛蒙揮發係數
Fmole=0.1;
a=2;%費洛蒙重要參數
b=5;%距離重要參數
% Onece=zeros(CAPITAL);%次數矩陣
%% 城市距離(範例參數)
% destion=[0,4,6,3;2,0,6,9;1,9,0,6;5,6,7,0];
destion=[0,153,510,706,966,581,455,70,160,372,157,567,342,398;
    153,0,422,664,997,598,507,197,311,479,310,581,417,376;
    510,422,0,289,744,390,437,491,645,880,618,374,455,211;
    706,664,289,0,491,265,410,664,804,1070,768,259,499,310;
    966,997,744,491,0,400,514,902,990,1261,947,418,635,636;
    581,598,390,265,400,0,168,522,634,910,593,19,284,239;
    455,507,437,410,514,168,0,389,482,757,439,163,124,232;
    70,197,491,664,902,522,389,0,154,406,133,508,273,355;
    160,311,645,804,990,634,482,154,0,276,43,623,358,498;
    372,479,880,1070,1261,910,757,406,276,0,318,898,633,761;
    157,310,618,768,947,593,439,133,43,318,0,582,315,464;
    567,581,374,259,418,19,163,508,623,898,582,0,275,221;
    342,417,455,499,635,284,124,273,358,633,315,275,0,247;
    398,376,211,310,636,239,232,355,498,761,464,221,247,0];
%% 初始費洛蒙
F=zeros(CAPITAL);%費洛蒙矩陣
initialize=antpart01(CAPITAL,F,Fmole);
%% 狀態轉換
for run =1:PP
    run
    antscore=[];
    antPP=[];
    antdestion=[];
    antskechle=[];
    for l =1:antp
        step2=antpart02(CAPITAL,initialize,F1,a,b,destion);
        F= initialize;
      %% 局部更新(套用公式(17))
        [step301,step302, initialize]=antpart03(CAPITAL,step2,HOTF,destion,antdestion,antskechle,F);
        antscore=[antscore;step301];
        antPP=[antPP;step302];   
        
    end
   
    
    %% 全域更新(挑最短距離並增加路徑的費洛蒙)
    [step4,initialize]=antpart04(CAPITAL,F,HOTF,antscore,antPP);
    
    
end
F
antscore(step4)
antPP(step4,:)
toc

%錯誤一 :狀態晚換，輪盤
%局部更新:位置 位置公式矩陣
%全域更新 公式
% %







