clc
clear
tic
%% 參數控制
chromosome = 100; %染色體數量 20
crossover = 0.7; %交配率  0.7
mutation = 0.9; %突變率   0.9
s =100; %迭代數
L1=0.6;
L2=0.4;
bsr = 0.6;
%% 釘書機
n = 18;  % 工作個數
order=[1 3;1 14;2 3;4 14;5 4;6 5;6 8;7 5;8 4;9 6;9 7;10 18;11 18;12 10;12 11;12 13;12 15;13 18;15 16;15 17]; %拆裝先後順序條件限制
order2 = [3 2;3 1;4 5;4 8;5 7;5 6;6 9;7 9;8 6;10 12;11 12;13 12;14 1;14 4;15 12;16 15;17 15;18 10;18 11;18 13]; %組裝先後順序條件限制
reuse=[2 5 7 9 13];% 重新使用
recycle=[3  10  14 16 17 18];%回收
Remanufacturing=[4 6 8 11 12];%重新加工
T1=[3 1 2 3 4 3 3 3 3 3 1 1 1 2 4 2 2 3];%工具
T2=[2 -2 -2 2 -2 -1 1 2 1 -2 2 -2 -2 -2 -2 -2 -2 -3];%方向
asb=[18];%選拆零件(利潤)
asb2=[1];%選拆零件(碳足跡)
Dc=[18	10	16	17	3	14	2	9	5	6	7	15	11	12	13	1	8	4];%liaison零件關係
DC2=[0.9297	0.911	0.797	0.797	0.797	0.797	0.482	0.294	0.266	0.266	0.224	0.1727	0.1727	0.1727	0.1354	0.0234	0.0234	0.0234];%liaison單一零件組拆裝成本
gw=[0.015,0.005,0.003,0.008,0.0025,0.003,0.0013,0.006,0.002,0.003,0.002,0.009,0.0021,0.0012,0.0025,0.003,0.003,0.004];%各零件重量
mc=[25     5     2    25    10     8     7    10     8     2     5    20     5     5     7     2     2     2];%各零件成本

%% 吊扇
% n=26;
% order = [5 1; 5 2;5 3;5 4;6 4;11 7;11 18;12 7;12 18;15 7;15 18;16 7;16 18;19 22;19 23;19 24;20 22;20 23;20 24;21 22;21 23;21 24;26 25;4 7;25 17;7 8;7 9;18 17;8 10;8 14;9 10;9 14;17 14;10 13;14 13];%限制排序
% T1=[2 2 2 1 1 1 1 1 1 3 1 1 3 3 1 1 1 1 1 1 1 1 1 1 4 2];%工具
% T2=[2 3 -3 3 2 2 3 3 3 3 3 3 -3 -3 -3 -3 -3 -3 -3 -3 -3 -3 -3 -3 -3 -3 ];%方向
%% 印表機
% n=52;
% order = [16 50;13 20;13 19;27 42;1 46;8 9;5 6;45 50;36 52;1 45;27 28;13 25;33 41;13 24;13 21;13 22;1 2;2 5;4 18;5 27;2 27;27 38;27 31;1 3;12 13;27 40;27 41;27 43;27 37;31 36;1 47;26 27;5 18;1 51;10 11;5 8;5 10;13 14;28 44;13 23;28 29;27 39;49 50;3 17;48 51;19 24;20 25;3 4;28 30;32 40;34 42;35 43;21 24;14 23;2 4;26 37;29 30;5 7;27 36;3 15;3 12;22 25]%限制排序
% T1=[1 1 2 2 2 2 2 2 2 2 2 2 2 2 2 1 2 2 2 2 1 1 2 1 1 2 2 1 2 2 1 2 2 2 2 2 2 1 2 2 2 2 2 2 1 2 2 2 2 1 2 2];%工具
% T2=[ 2 2 2 -2 1 1 -1 2 1 1 1 -1 2 2 1 -2 -2 -2 -2 2 2 2 2 2 2 -2 2 2 -2 2 -2 1 1 1 1 1 -2 -2 1 2 2 2 2 -2 2 3 -3 3 2 2 -3 2];%方向
%%  BOWMAN
% n = 8;  % 工作個數
% order = [1 2;2 3;2 4;3 5;3 6;4 6;5 7;6 8];  %先後順序條件限制
% Information = [11 17 9 5 8 12 10 3];  %各工作時間
% GCT = 20; %Given Cycle Time

%%
a=[];
a2=[];
b=[];
b2=[];
D=[];
D1=[];
x=[];
y=[];
Or = LBbn(order,n);
% Or2= LBbn(order2,n);
T22= direction(T2,n);

for i=1:chromosome %隨機產生初始解
    RR = randperm(n);
    RR = LBrr1(Or,n,RR);
    SS1 = LBss2(RR,T1,T22);
    SS2 = LBss3(RR,T1,T22);%選拆
    a=[a;RR];
    b=[b;SS1];
    a2=[a2;RR];
    b2=[b2;SS2];
    
end
for i1=1:s%% 原版
     i1
if i1>=2

    for i=1:chromosome-length(A(:,1)) %隨機產生初始解
        RR = randperm(n);
        RR = LBrr1(Or,n,RR);
        SS1 = LBss2(RR,T1,T22);
        SS2 = LBss3(RR,T1,T22);%選拆
        a=[a;RR];
        b=[b;SS1];
        a2=[a2;RR];
        b2=[b2;SS2];
    end
end

    %% 交配突變
    [a,b] = LBa0(n,a,b,crossover,chromosome,Or,bsr,T1,T22); %交配(block)選拆後利潤
    [a,b] = LBb0(n,a,b,Or,mutation,T1,T22); %突變(block)拆利潤
    [a2,b2] = LBa01(n,a2,b2,crossover,chromosome,Or,bsr,T1,T22); %交配(block)選拆後碳足跡
    [a2,b2] = LBb01(n,a2,b2,Or,mutation,T1,T22); %突變(block)拆碳足跡
    % 擁擠距離
    c=[];
    c2=[];
    a=[a;a2];
    for xx=1:length(a)
    c=[c,LBss3(a(xx,:),T1,T22)];
    c2=[c2,LBss2(a(xx,:),T1,T22)];

    end
%     a=[a;a2];
%     b=[[b',c'];[b2',c2']];
%     [f1,f2] = LBUN(a,b);
%     D1=[D1;f1];
%     D=[D;f2];
   
     %% hypervolume
     HV=[];
    [A,P2] = p(c2,c);
    for i =1:length(A)
   hv = hypervolume(A(i));
   HV=[HV;hv];
    end
x2=A(:,1);
y2=A(:,2);
a1=[];
b1=[];
for j =1:length(P2)
 a1=[a1;a(P2(j),:) ];
 
end
a=a1;
b=x2;
a2=a1;
b2=y2;
% P2=a()

end
% [f1,f2] = LBUN(D1,D);

ans = parajim(x2,y2)

toc